{"https://www.foxnews.com/politics/trump-rally-christmas-michigan": {"content": "President Trump speaks at campaign rally in Michigan. As the House voted to impeach him, President Trump gleefully taunted Democrats Wednesday night in a wild rally before thousands of supporters who lined up in the bitter Michigan cold to see him create one of the more stunning split-screen moments of his presidency. Back in Washington, House Democrats adopted two articles of impeachment related to his pressure campaign on Ukraine to launch political investigations. Simultaneously, at his “Merry Christmas” rally in Battle Creek, Mich., Trump sounded an almost-victorious note as he essentially argued that Democrats would rue the day. \"By the way, it doesn't really feel like we're being impeached,\" Trump opened his nearly two-hour speech. \"The country is doing better than ever before. We've done nothing wrong.\" \"The do-nothing Democrats, and they are do nothing, are declaring their deep hatred and disdain for [the] American voter\" with the impeachment process, Trump said. He called impeachment \"political suicide.\" \"Have you seen my poll numbers in the last four weeks?\" Trump added. \"They've been trying to impeach me since before I ran.\" <strong><a href=\"https://www.foxnews.com/politics/impeachment-vote-imminent-as-trump-plans\" target=\"_blank\">WITH TRUMP IMPEACHMENT VOTE IMMINENT, PRESIDENT TRAVELING TO BATTLE CREEK, MICH., TO RALLY THE FAITHFUL</a></strong> A staffer interrupted the speech to inform Trump of the outcome of the impeachment vote, which was 229 in favor and 198 against the article to impeach Trump for obstruction of Congress, and a 230-197 vote to impeach him for abuse of power. Trump pointed out that not one Republican voted in favor of impeachment but three Democrats voted against it. \"The Republicans have never been so affronted but they've never been so united as they are right now,\" he said. \"I'm the first person to ever get impeached and there's no crime!\" Trump said, adding that Democrats have \"cheapened\" the impeachment process. Trump slammed House Intelligence Committee Chairman Rep. Adam Schiff, D-Calif., as a \"pathological liar\" for the dramatized version of his phone call with Ukrainian President Volodymyr Zelensky. Trump also mocked Schiff for his looks. \"With Me Too, I never even think about looks anymore, OK? I don't talk about looks of a male or female,\" Trump said. \"I'll say, just one last time, Schiff is not exactly the best-looking guy.\" \"Didn't he have eight quid pro quos?\" Trump said of Schiff's version of his phone call that was read out on the House floor. \"You say it eight times, they have you arrested they put you into an insane asylum.\" \"Democrats do not believe you have the right to select your own president,\" Trump told the crowd. Trump said Democrats should not be allowed to hold an impeachment after the Russia investigation. \"Think of what they did, think of how dishonest it was -- they shouldn't even be allowed to hold an impeachment,\" he said. \"Comey, he’s another beauty, did I not do a great job when I fired his a--?\" Trump said. He said \"Trump haters\" cost taxpayers \"billions and billions\" of dollars in what didn't get done during the Mueller investigation. Trump said that Michigan has had the \"best year it's ever had\" due to auto companies \"expanding, thriving, coming in from Japan.\" \"I said, 'Why are you allowing them to steal your car companies? Why are you allowing them to come in from China?'\" Trump recounted from a previous speech in front of Michigan lawmakers. Trump touted the USMCA trade deal, which is expected to pass the House on Thursday as a replacement to NAFTA. \"We had tremendous trade barriers with Canada, a tax on dairy products... nobody talked about it,\" he said. Trump blamed House Speaker Nancy Pelosi, D.-Calif., for the deal's delay, saying: \"The deal has been sitting with Nancy Pelosi for a long time. She had a lot of pressure from manufacturing farm areas.\" \"The Democrats try to take credit for this deal and that's okay, whatever it takes,\" Trump added. Two protesters held a sign in the stands that read \"Don the Con you're fired;\" they received echoing boos and \"USA\" chants throughout the arena. \"There's a slob, a real slob. She’ll get hell when she gets back home with mom,\" Trump chimed in. <strong><a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> He pivoted back to trade with China. \"China’s paying us billions and billions of dollars a year. They never gave us ten cents,\" he said, adding that he was leaving many of the 25 percent tariffs, allowing for billions in subsidies to farmers. Trump claimed to make the largest investment in the U.S. military ever, saying his administration invested $738 million more on military equipment all made in the U.S. He said the nation was building the \"most powerful weapons in the world.\" \"You know the way we're, not going to have to use them, is if we have them,\" he said. Trump briefly turned to his potential Democratic opponents, saying that Sen. Elizabeth Warren had a big crowd in New York but his son Barron could go into Central Park and attract \"the same or a bigger crowd\" though he's 13. Trump said that at a \"big\" rally for former Vice President Joe Biden, 93 people would show up. \"I thought I knocked off Pocahantas, I did it a year too early,\" Trump said of Pete Buttigieg's surge to the top of the polls, as Warren did earlier in the race. \"Who wants to watch Buttigieg? It's an unpronouncable name.\" \"Boot-edge-edge, like the edge of a building,\" Trump added.", "authors": "Morgan Phillips", "title": "Trump taunts Dems at Michigan rally: 'Doesn't really feel like we're being impeached'"}, "https://www.foxnews.com/politics/2020-democrats-biden-booker-sanders-warren-buttigieg-gabbard-impeachment-reaction": {"content": " The Democrat-controlled House of Representatives on Wednesday night adopted two articles of impeachment against President Trump, advancing them both to the Senate for a future trial, but one notable 2020 Democratic presidential contender voted \"present\" -- rather than yay or nay. <a href=\"https://www.foxnews.com/politics/tulsi-gabbard-votes-present-trump-impeachment-articles\" target=\"_blank\">Rep. Tulsi Gabbard, D-Hawaii, was the only member of Congress who voted \"present\"</a>, shirking her party's almost unanimous vote to move the impeachment articles forward. \"Throughout my life, whether through serving in the military or in Congress, I’ve always worked to do what is in the best interest of our country. Not what’s best for me politically or what’s best for my political party,\" Gabbard said in a statement following the vote. \"After doing my due diligence in reviewing the 658-page impeachment report, I came to the conclusion that I could not in good conscience vote either yes or no.\" Meanwhile, other presidential hopefuls called the votes a \"solemn moment\" and a \"sad day\" for the country. <strong><a href=\"https://www.foxnews.com/politics/tulsi-gabbard-votes-present-trump-impeachment-articles\" target=\"_blank\">TULSI GABBARD VOTES 'PRESENT' ON TRUMP IMPEACHMENT ARTICLES, BREAKS WITH DEMS</a></strong> Former <a href=\"https://www.foxnews.com/category/person/joe-biden\" target=\"_blank\">vice president Joe Biden</a>, whose family has been the target of Trump's alleged quid pro quo deal with the leader of Ukraine to open an investigation into their family, called the vote a \"solemn moment for our country.\" \"President Trump abused his power, violated his oath of office, and betrayed our nation,\" Biden said. \"This is a solemn moment for our country. But in the United States of America, no one is above the law -- not even the President.\" <a href=\"https://www.foxnews.com/category/person/bernie-sanders\" target=\"_blank\">Sen. Bernie Sanders, I-Vt.</a> -- who will likely be a juror when the articles move to a Senate trial -- said on Twitter: \"Today is a sad but necessary day for American democracy. The U.S. House has voted to impeach President Trump, and that is the right thing to do.\" \"No individual in this country, certainly not the president of the United States, is above the law, is above the Constitution,\" Sanders continued in a video statement. \"Now the process moves to the U.S. Senate where there'll be a trial.\" \"We cannot have a pathological liar in the White House,\" he added. Sen. Cory Booker, D-N.J., also called the vote on impeachment a \"sad moment for our country.\" \"The three-month House impeachment process has uncovered alarming evidence that an American president used his official power for personal gain, put our national security at risk, and obstructed the investigation,\" he said. \"As this process heads to the Senate for trial, I'll uphold my sacred oath to protect &amp; defend the Constitution,\" Booker added. \"This trial demands an impartial &amp; thorough review of the evidence. We must be presented with relevant witnesses &amp; documents, and follow the evidence where it leads.\" Sen. Elizabeth Warren, D-Mass., echoed the oath of her fellow Democratic colleagues in the Senate, saying she is braced for the inevitable trial. \"Donald Trump has abused our diplomatic relationships and undermined our national security for his own personal, political gain. By voting to impeach him, the House has taken an important step to hold him accountable. I'm ready to fulfill my constitutional duty in the Senate,\" Warren tweeted. <strong><a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\">CLICK HERE FOR THE FOX NEWS APP</a></strong> Mayor Pete Buttigieg, from South Bend, Indiana, also reacted to the House votes. \"Our lawmakers take an oath not to party but to country,\" he tweeted. \"That oath is all the more important in the most difficult of times. Today it required Congress to defend the rule of law, our national security, and our democracy from a president who puts his own interests above America's.\" \"But this is not just about this moment or this president,\" he added. \"It's about our democracy itself. It's about the era to come after this president leaves office. More than ever, we need leadership to pick up the pieces and move our nation forward.\"", "authors": "Vandana Rambaran", "title": "2020 Dem candidates react to impeachment votes: 'A sad moment'"}, "https://www.foxnews.com/us/ed-buck-hires-former-oj-simpson-prosecutor-christopher-darden": {"content": "Democratic donor Ed Buck has been indicted by a federal grand jury on two counts of distributing methamphetamine resulting in the death of two individuals; William La Jeunesse reports. <a href=\"https://www.foxnews.com/category/us/us-regions/west/california\" target=\"_blank\">California</a> Democratic activist and <a href=\"https://www.foxnews.com/us/mother-of-gemmel-moore-speaks-out-about-federal-charges-for-ed-buck-in-her-sons-2017-overdose-death\" target=\"_blank\">megadonor Ed Buck</a> has hired former <a href=\"https://www.foxnews.com/category/us/oj-simpson-case\">O.J. Simpson</a> prosecutor <a href=\"https://www.foxnews.com/us/former-oj-prosecutor-defending-alleged-nipsey-hussle-killer-steps-down\">Christopher Darden</a> to defend him against federal charges in connection with two overdose deaths at his West Hollywood apartment, according to new reports. <a href=\"https://www.foxnews.com/us/dem-megadonor-ed-buck-federally-indicted-for-2-overdose-deaths-at-his-home-providing-meth-to-3-more-men\">Buck was indicted in October</a> with distributing methamphetamine that resulted in the deaths of Timothy Dean in January and Gemmel Moore in 2017. Federal prosecutors said Buck, 65, who has given hundreds of thousands of dollars to Democratic causes, preyed on vulnerable gay black men and pressured them to let him inject them with drugs as part of a sexual ritual known as “party and play,\"  <a href=\"https://www.nbclosangeles.com/news/local/ed-buck-hires-noted-attorney-to-defend-federal-drug-death-case/2278443/\">NBC Los Angeles</a> reported. <a href=\"https://www.foxnews.com/us/major-democratic-donor-ed-buck-arrested-charged-with-running-drug-den\">Buck was arrested Sept. 17</a> and hit with state charges of operating a drug house. <a href=\"https://www.foxnews.com/us/ed-buck-dem-megadonor-hit-with-federal-charge-in-mans-2017-overdose-death\">Two days later, federal prosecutors charged him with distributing methamphetamine that resulted in Moore’s death.</a> <a href=\"https://www.latimes.com/california/story/2019-12-18/christopher-darden-former-o-j-prosecutor-to-defend-political-donor-charged-with-giving-fatal-doses-of-drugs\">The Los Angeles Times</a> reported that Darden confirmed he will take on the Buck case: “That’s all I can say today,” he said. “I haven’t received any discovery yet, so that’s all I can say.” The newspaper reported that court records show Darden replaced Buck’s deputy public defender, Claire Simonich, on Dec. 5. Buck is being held without bail, and his trial is set for August at the earliest. The federal charges bring a mandatory minimum sentence of 20 years if Buck is convicted in the deaths. <strong><a href=\"https://www.foxnews.com/politics/clinton-obama-silent-on-ed-buck-donations-after-dem-megadonors-sudden-arrest\">CLINTON, OBAMA SILENT ON ED BUCK DONATIONS</a></strong> <a href=\"https://www.foxnews.com/us/2-died-before-arrest-of-democratic-megadonor-ed-buck-and-some-question-delay\">Family members of the victims had criticized local prosecutors for not charging Buck in the deaths.</a> Moore’s family and friends have said Buck got favorable treatment because of his status and reputation, and that the victims were ignored because they were gay black men, drug users and often sex workers. “If white gay men had been dying in a black man’s house or anybody’s house, rather, this case would have been taken a lot more seriously,” said <a href=\"https://twitter.com/Jasmyne\">Jasmyne Cannick</a>, a communications strategist who spearheaded the effort to get justice for Moore. “Ed Buck knew who he was preying on, and he knew that people would not care. Or he thought that people would not care.” Los Angeles County District Attorney Jackie Lacey has said politics played no role in her decision not to prosecute Buck in the deaths of the two men. She defended her decision and said there was insufficient evidence to proceed with murder charges. The Los Angeles County Sheriff’s Department reopened the case after the second death in January. In July, the U.S. attorney’s office took the case after sheriff’s detectives approached a federal task force investigating opioid overdoses. Buck has donated tens of thousands of dollars to California candidates, including Democratic Gov. Gavin Newsom, and is well known in LGBTQ political circles. According to federal records, Buck contributed more than $500,000 to Democratic groups -- including $1,500 <a href=\"https://www.foxnews.com/politics/clinton-obama-silent-on-ed-buck-donations-after-dem-megadonors-sudden-arrest\" target=\"_blank\">to Barack Obama's presidential campaign</a> and $2,950 to the Hillary Clinton campaign. Buck gained fame by leading a 1987 campaign to recall Republican Arizona Gov. Evan Mecham, who was ultimately convicted in an impeachment trial and kicked out of office. Buck had been a Republican but said he switched party affiliation to Democrat because he felt the GOP was intolerant toward the gay community. He has told reporters that he worked as a male model in Europe in his youth and returned to Phoenix, where he worked for a friend’s company, eventually buying it out of bankruptcy for $250,000 and turning it around for a profit of more than $1 million. <strong><a href=\"https://www.foxnews.com/apps-products?pid=AppArticleLink\" target=\"_blank\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> He said he retired to West Hollywood in 1991 at the age of 37 and became active in animal rescue efforts. <em>The Associated Press contributed to this report.</em>", "authors": "Frank Miles", "title": "Ed Buck hires former OJ Simpson prosecutor Christopher Darden for defense"}, "https://www.foxnews.com/politics/federal-appeals-court-strikes-down-obamacare-law-setting-up-supreme-court-showdown": {"content": "Fox News Flash top headlines for Dec. 18 are here. Check out what's clicking on Foxnews.com A federal appeals court upheld a lower court’s ruling that a key aspect of the ObamaCare law is unconstitutional -- setting up another likely <a href=\"https://www.foxnews.com/category/politics/judiciary/supreme-court\" target=\"_blank\">Supreme Court</a> showdown in a presidential election year. The 5th Circuit U.S. Court of Appeals by a 2-1 vote concluded the original law’s key funding mechanism known as the individual mandate — requiring most Americans to purchase health insurance or face a tax penalty — was properly eliminated by Congress and therefore the entire law could not be enforced. The appeals panel sent the issue back to the lower court to decide whether other aspects of the Affordable Care Act must fall. The three-judge panel of the 5th U.S. Circuit Court of Appeals in New Orleans agreed with Texas-based U.S. District Judge Reed O'Connor’s finding that the insurance requirement was rendered unconstitutional when, in 2017, Congress eliminated a tax penalty on people without insurance. “The individual mandate is unconstitutional because it can no longer be read as a tax, and there is no other constitutional provision that justifies this exercise of congressional power,” the ruling said. “On the severability question, we remand to the district court to provide additional analysis of the provisions of the ACA as they currently exist.” <a href=\"https://www.foxnews.com/politics/house-approves-1-4-trillion-spending-bill-avoiding-government-shutdown\" target=\"_blank\"><strong>HOUSE APPROVES $1.4 TRILLION SPENDING BILL, REPEALING OBAMACARE TAXES </strong></a> The appeals court concluded because the individual mandate was unconstitutional, the law’s funding mechanism could not be enforced in the current version of the Affordable Care Act. Other parts of the law may survive, but the appeals court deferred to the lower court to decide the severability question —whether the entire law must be struck down or what parts of the law could still exist. It comes as the administration is working with Congress for a replacement health care reform law. <a href=\"https://www.foxnews.com/politics/supreme-court-offers-sympathetic-ear-to-insurers-over-12-billion-in-obamacare-claims\" target=\"_blank\"><strong>SUPREME COURT OFFERS SYMPATHETIC EAR TO INSURERS OVER $12B IN OBAMACARE CLAIMS</strong></a> Texas and 18 other Republican-led states filed the suit, which was defended by Democrats and the House of Representatives. Texas argued that due to the unlawfulness of the individual mandate, the entire ACA must be scrapped. \"It may still be that none of the ACA is severable from the individual mandate, even after this inquiry is concluded,\" Judge Jennifer Walker Elrod said in her majority opinion. \"It may be that all of the ACA is severable from the individual mandate. It may also be that some of the ACA is severable from the individual mandate, and some is not.” <strong><a href=\"https://www.foxnews.com/apps-products?pid=AppArticleLink\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> Dissenting Judge Carolyn Dineen King said her colleagues were prolonging “uncertainty over the future of the healthcare sector.” King said she would have found the mandate constitutional, although unenforceable, and left the rest of the law alone. “In 2012, the Supreme Court upheld Obamacare, despite serious constitutional issues with the federal government forcing Americans to purchase a product from a private company. Until an ultimate decision is made by the Supreme Court or Congress decides otherwise, the <em>Affordable Care Act</em> will remain the law of the land,” Sen. Chuck Grassley, R-Iowa, said in a statement after the ruling.<strong> \"</strong>Congress should work to ensure that no matter the ultimate outcome, Americans who have pre-existing conditions are protected from losing their insurance or facing discrimination. This is something that has broad, bipartisan support.\" <em>The Associated Press contributed to this report. </em>", "authors": "Bill Mears Morgan Phillips", "title": "Federal appeals court strikes down ObamaCare rule, setting up Supreme Court showdown"}, "https://www.foxnews.com/entertainment/celebrities-react-trump-impeachment": {"content": "Fox News Flash top entertainment and celebrity headlines for Dec. 19 are here. Check out what's clicking today in entertainment. The news of President Trump's <a href=\"https://www.foxnews.com/category/politics/trump-impeachment-inquiry\">impeachment</a> by the House of Representatives on Wednesday night has rocked the nation in recent hours, with largely anti-Trump Hollywood being no exception. Following the party-line votes on two articles of impeachment -- on abuse of power and obstruction of Congress -- <a href=\"https://www.foxnews.com/category/entertainment/celebrity-news\">stars of all political stripes</a> took to Twitter to express their views. Singer and actress <a href=\"https://www.foxnews.com/search-results/foxnews.com/category/person/bette-midler\" target=\"_blank\">Bette Midler</a>, long an outspoken Trump critic, shared a simple message online, writing: \"Impeached.\" <a href=\"https://www.foxnews.com/politics/impeachment-debate-floor\" target=\"_blank\"><strong>HOUSE IMPEACHES TRUMP OVER UKRAINE DEALINGS, AS PELOSI FLOATS HOLDING UP SENATE TRIAL</strong></a> Actor Jon Voight, long a vocal supporter of President Trump, posted a video with a message of faith. \"This left wing lacks truth,\" Voight said, \"and are afraid of Trump's truth to save this country. ... The left are afraid of the 'true truths' that President Trump has brought forth.\" Actress and activist <a href=\"https://www.foxnews.com/search-results/foxnews.com/category/person/alyssa-milano\" target=\"_blank\">Alyssa Milano</a> revealed she wasn't nearly as happy as she thought she'd be. \"I expected this moment but I expected to be more joyful,\" she tweeted. \"Maybe jump up &amp; do a happy dance. Maybe.\" \"But I’m just sad and heartbroken,\" Milano admitted. \"What he’s left behind can’t be erased with this vote. The bigotry and xenophobia he’s emboldened. The lies. It will take generations to recover.\" \"Riverdale\" star <a href=\"https://www.foxnews.com/entertainment/adam-sandler-cole-sprouse-reunite-20-years-big-daddy\" target=\"_blank\">Cole Sprouse</a>, however, was in much merrier spirits. <a href=\"https://www.foxnews.com/entertainment/kate-middleton-prince-william-old-fashioned-marriage-report\" target=\"_blank\"><strong>KATE MIDDLETON, PRINCE WILLIAM HAVE AN 'OLD-FASHIONED MARRIAGE': REPORT</strong></a> \"Time for a celebration,\" he wrote online. He also shared a cheeky reference to a classic Christmas tune. \"Sleeeeep im-heavenly-peaaaachhhhh,\" he said, refering to the lyrics of \"Silent Night.\" \"SLEEeep im-heavenlllly-peachhhh. #happyholidays2019.\" \"What a time to be alive,\" noted reality star <a href=\"https://www.foxnews.com/entertainment/jordyn-woods-kardashian-jenner-cheating-drama-cancerous\" target=\"_blank\">Jordyn Woods</a>. \"Juice\" singer <a href=\"https://www.foxnews.com/entertainment/lizzo-ariana-grande-good-as-hell-collaboration-remix\" target=\"_blank\">Lizzo</a> seemed to express some genuine confusion. \"WHAT HAPPENS NEXT?\" she asked in all capital letters. <a href=\"https://www.foxnews.com/entertainment/r-kelly-pleads-not-guilty-bribery\" target=\"_blank\"><strong>R. KELLY PLEADS NOT GUILTY TO BRIBERY CHARGE</strong></a> <a href=\"https://www.foxnews.com/entertainment/jersey-shore-star-vinny-asks-for-kim-kardashians-help-getting-mike-the-situation-out-of-prison\" target=\"_blank\">Vinny Guadagnino</a>, star of \"<a href=\"https://www.foxnews.com/search-results/foxnews.com/category/entertainment/genres/reality\" target=\"_blank\">Jersey Shore</a>,\" expressed that he'd prefer Trump stay in office rather than have Vice President Mike Pence take over. \"People want Trump impeached but you really want Pence?\" Guadagnino said. \"He reminds me of one of the founding fathers in the purge.\" <a href=\"https://www.foxnews.com/entertainment/camila-cabello-apologizes-racist-language\" target=\"_blank\"><strong>CAMILA CABELLO APOLOGIZES FOR PAST RACIST LANGUAGE: 'I WAS UNEDUCATED AND IGNORANT'</strong></a> Actor <a href=\"https://www.foxnews.com/entertainment/dean-cain-sean-spicer-dancing-stars-liberals\" target=\"_blank\">Dean Cain</a> voiced general frustration toward the whole event. \"This partisan, political impeachment is an embarrassment,\" he noted. <a href=\"https://www.foxnews.com/apps-products?pid=AppArticleLink\" target=\"_blank\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> Actress <a href=\"https://www.foxnews.com/entertainment/kirstie-alley-twitter-feud-democratic-advisor-wealth-socialism\" target=\"_blank\">Kirstie Alley</a> warned fans about what's to come following the impeachment. \"Dangerous precedent, she warned. \"Gonna cause a major tit for tat retaliation now for whoever is in power... fasten your seatbelts, it’s gonna be a bumpy decade.\"", "authors": "Nate Day", "title": "Stars of all political stripes respond to Trump impeachment news"}, "https://www.foxnews.com/politics/republican-party-sets-fundraising-record-amid-impeachment-battle": {"content": "Ronna McDaniel, RNC Chairwoman, discusses if the Democrats impeachment push could result in losing seats in November <strong>EXCLUSIVE: </strong>The Republican National Committee has announced record fundraising numbers amid the <a href=\"https://www.foxnews.com/category/politics/trump-impeachment-inquiry\" target=\"_blank\">impeachment</a> drive against President Trump, hauling in a whopping $20.6 million in November, according to Federal Election Commission data obtained by Fox News. The RNC told <a href=\"https://www.foxnews.com/category/politics/trump-impeachment-inquiry\" target=\"_blank\">Fox News</a> that this is the best November on record in party history. <a href=\"https://www.foxnews.com/media/mitch-mcconnell-impeachment-chuck-schumer-trial\" target=\"_blank\"><strong>MCCONNELL: 'WE'VE HEARD ENOUGH' ON IMPEACHMENT, PROLONGED SENATE TRIAL COULD BE 'EMBARRASSING SCENE'</strong></a> The party currently has $63.2 million in cash — marking the most cash-on-hand it has had since before the 2012 presidential election. “Democrats’ baseless impeachment charade has only served to bolster our base and attract more voters to our cause and the result is another record-breaking fundraising month,” RNC Chairwoman Ronna McDaniel told Fox News. “President Trump’s policies made historic progress this month as well, with USMCA clearing another legislative hurdle, paid-family leave secured for federal employees, and 266,000 jobs added to the economy — all while Nancy Pelosi’s impeachment sham droned on.” She added: “Voters will make their voices heard by re-electing President Trump and voting for Republicans up and down the ballot in 2020.” <a href=\"https://www.foxnews.com/politics/rnc-launches-stop-the-madness-campaign-to-fight-impeachment-push\" target=\"_blank\"><strong>RNC LAUNCHES 'STOP THE MADNESS' CAMPAIGN TO FIGHT IMPEACHMENT PUSH</strong></a> The House of Representatives voted Wednesday to impeach Trump, adopting two articles of impeachment alleging abuse of power and obstruction of Congress. The case now heads to the Senate for trial. The GOP fundraising underscores how Republicans have sought to turn the impeachment fight to their advantage, tapping into an outraged base to fuel not only the president's 2020 re-election effort but also a political offensive against congressional Democrats. Republicans are specifically using their November success to bolster their “Stop the Madness” campaign, a national counter-impeachment push targeting House Democrats that was launched in September. Earlier this month, the RNC spent an additional $350,000 for another paid push targeting 29 Democrats in Trump-won congressional districts. Since the campaign’s launch, the RNC has held more than 140 “Stop the Madness” events from Maine to California aimed at those Democrats -- ranging from protests to trainings for volunteers. Those trainings have brought in nearly 100,000 new volunteers, the party says. Fox News has also learned that the Trump re-election campaign and the RNC have spent nearly $11 million in ads as part of the nationwide push against vulnerable Democrats, many of whom campaigned in 2018 on reaching across the aisle to work with Trump. <a href=\"https://foxnews.onelink.me/xLDS?pid=AppArticleLink&amp;af_dp=foxnewsaf%3A%2F%2F&amp;af_web_dp=https%3A%2F%2Fwww.foxnews.com%2Fapps-products\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> The new fundraising numbers come amid the heated impeachment battle in Washington. At the center of the inquiry is Trump’s efforts to press Ukrainian President Volodymyr Zelensky to launch politically related investigations — regarding former Vice President Joe Biden and his son Hunter’s dealings in Ukraine, as well as issues related to the 2016 presidential election. The president’s request came after millions of dollars in U.S. military aid to Ukraine had been frozen, which Democrats argue shows a “quid pro quo” arrangement. Trump has denied any wrongdoing.", "authors": "Brooke Singman", "title": "Republican Party sets fundraising record amid impeachment battle"}, "https://www.foxnews.com/media/heather-macdonald-college-campus-protesters-free-speech-bias-hatred": {"content": "Heather Mac Donald, \"The Diversity Delusion\" author, addresses being protested at the College of the Holy Cross and the \"close-mindedness\" being cultivated by adults on college campuses <a href=\"https://www.foxnews.com/category/politics/senate/republicans\" target=\"_blank\">Conservative</a> speaker and author <a href=\"https://www.foxnews.com/person/m/heather-mac-donald\" target=\"_blank\">Heather Mac Donald</a> said Thursday that there is a \"welling tide\" of \"hatred\" consuming <a href=\"https://www.foxnews.com/category/us/education/college\" target=\"_blank\">college</a> campuses. Appearing on <a href=\"https://www.foxnews.com/category/media/fox-news-flash\" target=\"_blank\">\"Fox &amp; Friends\"</a> with host Ainsley Earhardt, Mac Donald recounted her <a href=\"https://www.nationalreview.com/corner/ad-majorem-neves-gloriam/\" target=\"_blank\">recent experience</a> coming under fire from student protesters at the College of the Holy Cross in Worcester, <a href=\"https://www.foxnews.com/category/us/us-regions/northeast/massachusetts\" target=\"_blank\">Mass</a>. \"I was there to say to students: 'you are the most privileged individuals in human history. You have unfettered opportunity to learn,\" she explained. <strong><a href=\"https://www.foxnews.com/us/texas-state-university-student-sues-pi-kappa-phi-fraternity-over-beating\" target=\"_blank\">TEXAS STATE UNIVERSITY STUDENT SUES PI KAPPA PHI FRATERNITY OVER BEATING THAT LEFT HIM WITH BRAIN INJURY</a></strong> Mac Donald said that 50 minutes into her talk, half the people in the auditorium stood up and started chanting 'my oppression is not a delusion,' 'your racism is not welcome,' 'your sexism is not welcome,' 'your homophobia is not welcome'...'you are not welcome...' \"So, I addressed what had just happened and said this is a perfect demonstration of the closed-mindedness that is being cultivated by adults, frankly, on campuses. And then proceeded with my talk to a half-empty room,\" she explained. However, in a <a href=\"https://www.wsj.com/articles/why-our-students-objected-to-mac-donald-11575416308\" target=\"_blank\">new Wall Street Journal op-ed</a>, Holy Cross Dean Michelle C. Murray is now defending her students' behavior, writing that \"...education requires them to wrestle with a wide range of ideas, which sometimes means engaging with controversial messages, as with Ms. Mac Donald. And sometimes, it means making use of their own free speech to combat objectionable ideas.\" Mac Donald, a Manhattan Institute fellow, told Earhardt that one of the organizers boasted about their accomplishments after they were filed out of the room. \"No,\" she said. \"They didn't accomplish something.\" Earhardt asked Mac Donald why she thought it was dangerous for students to feel like they are oppressed and not privileged. \"Well, for one, it prevents them from seizing the boundless opportunities for learning that they have if they go around with a chip on their shoulder,\" she said. \"Two: truth matters. It's simply good to accurately analyze your <a href=\"https://www.foxnews.com/category/us/environment\" target=\"_blank\">environment</a>.\" \"And for them to not understand that there is no bigotry on a college campus is simply a profound misunderstanding of their world. If they can think that they are oppressed on a college campus ... they carry that idea with them into the country at large,\" Mac Donald added <strong><a href=\"https://www.foxnews.com/apps-products?pid=AppArticleLink\" target=\"_blank\">CLICK HERE FOR THE FOX NEWS APP</a></strong> She said that America has had civil peace in this country because \"we have transcended our differences\" and \"engaged with ideas in a rational matter\" which has \"given us freedom.\" \"But, what we see now is a welling tide of, frankly, it is hatred,\" she said. \"We are a land of opportunity. People are coming from the <a href=\"https://www.foxnews.com/world\" target=\"_blank\">world</a> over in order to take advantage of our freedoms, and the students do not see that.\"", "authors": "Julia Musto", "title": "Heather Mac Donald on confrontation with student protesters: 'Welling tide' of hatred consuming college campuses"}, "https://www.foxnews.com/media/ted-cruz-democrats-panic-impeachment-case-collapsed": {"content": "Texas Senator Ted Cruz comments on Nancy Pelosi's \"remarkable\" threat that she will not send articles of impeachment to the Senate. On the morning after the House voted to <a href=\"https://www.foxnews.com/politics/impeachment-debate-floor\" target=\"_blank\">impeach President Trump</a> for \"abuse of power\" and \"obstruction of Congress\" related to his dealings with Ukraine, Republican <a href=\"https://www.foxnews.com/category/person/ted-cruz\" target=\"_blank\">Texas Senator Ted Cruz</a> said on “<a href=\"https://www.foxnews.com/shows/fox-and-friends\" target=\"_blank\">Fox &amp; Friends</a>” that <a href=\"https://www.foxnews.com/category/politics/elections/democrats\" target=\"_blank\">Democrats</a> are anxious because their case has collapsed.  “I think the Democrats are in a total panic,\" Cruz said Thursday. \"Yesterday was a very, very bad day for Democrats and it was a bad day for the <a href=\"https://www.foxnews.com/category/politics/house-of-representatives\" target=\"_blank\">House of Representatives</a> and for the country.” Cruz also referred to House Speaker <a href=\"https://www.foxnews.com/category/person/nancy-pelosi\" target=\"_blank\">Nancy Pelosi's</a> suggestion that she could <a href=\"https://www.foxnews.com/politics/impeachment-debate-floor\" target=\"_blank\">hold off on sending the case to the Senate</a> for an impeachment trial. Some Democrats have argued Pelosi should withhold the articles until Republicans in the Senate agree to certain conditions for the trial. <strong><a href=\"https://www.foxnews.com/politics/impeachment-debate-floor\" target=\"_blank\">HOUSE IMPEACHES TRUMP OVER UKRAINE DEALINGS, AS PELOSI FLOATS HOLDING UP SENATE TRIAL</a></strong> “When it comes to Pelosi, her threat is really quite remarkable. Her threat to the Senate is, ‘Do exactly what I want, or I’m not going to impeach the president. I’m not going to send over the impeachment articles,’” Cruz said, daring Pelosi to follow through. “My attitude is, okay, throw us in that briar-patch,\" he continued. \"Don’t send them; that’s alright, we actually have work to do. Some of us are showing up fighting for more jobs, for higher wages, for the working men and women who elected us.”  Cruz also mentioned Trump’s comment to supporters in <a href=\"https://www.foxnews.com/politics/trump-rally-christmas-michigan\" target=\"_blank\">Battle Creek, Mich.</a> on Wednesday night as the president responded in real-time to his impeachment.  “I’m the first person to ever get impeached, and there is no crime,” Trump said. <strong><a href=\"https://www.foxnews.com/politics/impeachment-debate-floor\" target=\"_blank\">HOUSE IMPEACHES TRUMP</a></strong> Cruz said Trump was “exactly right” when he made that comment. “This has never happened in the history of the country,” Cruz said. “The prior impeachments, in every one of them, the articles alleged a federal crime. This one doesn’t.” <strong><a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> “It is exceptionally weak and it doesn’t meet the constitutional standard for high crimes and misdemeanors,\" he added.  \"And that’s why Pelosi knows when it goes to the <a href=\"https://www.foxnews.com/category/politics/senate\" target=\"_blank\">Senate</a>, there’s going to be a fair trial in the Senate. But this is not going to succeed because the House hasn’t proven its case.”  <em>Fox News’ Gregg Re contributed to this report. </em>", "authors": "Talia Kaplan", "title": "Ted Cruz: Democrats 'in a total panic' over impeachment because their case collapsed"}, "https://www.foxnews.com/opinion/william-barr-unfit-attorney-general-von-spakovsky-fund": {"content": "Former Acting Attorney General Matt Whitaker reacts to former Obama Attorney General Eric Holder's critical op-ed. The recent commentary by Eric Holder in the Washington Post unfairly attacking <a href=\"https://www.foxnews.com/category/person/william-barr\" target=\"_blank\">William Barr </a>only shows how unfit he was to be the attorney general of the United States, not Bill Barr.  Contrary to his outlandish claims against Barr, there has never been a more “nakedly partisan” attorney general to serve in that office than Holder himself. As we outlined several years ago in our book about Holder’s mismanagement of the Justice Department, “Obama’s Enforcer – Eric Holder’s Justice Department,” <a href=\"https://www.foxnews.com/category/person/eric-holder\" target=\"_blank\">Holder </a>– who referred to himself as Barack Obama’s wingman – was the first attorney general in history to be held in contempt by Congress for his cover-up of one of the most reckless Justice Department operation in history. <a href=\"https://nation.foxnews.com/outgunned-the-fast-furious-scandal/\" target=\"_blank\">Operation Fast and Furious </a>involved the smuggling of thousands of weapons across the southern border where agents lost sight of and control over the guns as the crossed the border.  Those weapons were used by the drug cartels to kill hundreds of Mexican citizens and a U.S. border agent. <strong><a href=\"https://www.foxnews.com/media/matthew-whitaker-attorney-general-eric-holder-obama-trump-partisan-bias\" target=\"_blank\">FORMER ACTING AG WHITAKER HITS BACK AT ERIC HOLDER'S 'ODD' CRITICISM OF WILLIAM BARR</a></strong> We interviewed many sources both inside and outside of the Justice Department for our book. They all told us the same thing:  Holder politicized and radicalized the department to an extent they had never seen before. They stated that every decision made by Holder was through a political lens, not a legal lens. Holder treated Congress with contempt and did everything he could to evade its oversight responsibilities by misleading, misinforming, and ignoring members of Congress and its committees.  They reported that he filled the career ranks of the Justice Department with political allies, cronies, and Democratic Party donors, in what they believed were clear violations of civil service rules. Many of those cronies and political hacks are still there and have been doing everything they can from inside DOJ to attack President Trump and get him removed from office. Holder treated Congress with contempt and did everything he could to evade its oversight responsibilities by misleading, misinforming, and ignoring members of Congress and its committees. He directed his Civil Rights Division to misuse discrimination laws to attack state efforts to improve the integrity of elections, doing everything he could to make it easier to commit voter fraud, which has occasionally facilitated the election of members of his own party. The former attorney general misused that same Division to restrict the First Amendment rights of pro-life protesters in prosecutions that were thrown out by judges, one of whom speculated that the meritless prosecution was the “product” of what amounted to a conspiracy between the government and the abortion clinic to shut down legal protests. Holder damaged our national security by insisting that terrorists be treated as ordinary domestic criminals. He prosecuted the leakers of classified information in the lower levels of government but never went after his allies in the White House when they were caught leaking sensitive and classified information that benefited the public image of Barack Obama.   Holder is apparently unconcerned over the Inspector General’s report that showed that the FBI misled the FISA court, failing to inform the court of exculpatory information that conflicted with its claims, and omitting evidence that showed its primary source, Christopher Steele, was a liar and a con man who was working for the political campaign of Hillary Clinton. The same Hillary Clinton whom Holder – when he was the deputy attorney general in 1999 during the Clinton administration -- helped garner votes for in New York in her Senate run by helping to arrange the pardons of 16 unrepentant Puerto Rican terrorists, some of whom had carried out bombings, armed robberies, and murders.  In other words, he politicized the pardon process in what former federal prosecutor Andrew McCarthy said were “embarrassingly naked instances of justice succumbing to influence peddling.” During his tenure as attorney general, Holder showed that he had no problem with the government spying on Americans when the Justice Department secretly <a href=\"https://www.nytimes.com/2013/05/14/us/phone-records-of-journalists-of-the-associated-press-seized-by-us.html\">seized</a> telephone records of Associated Press reporters. Holder even went after then-Fox News reporter James Rosen, obtaining a secret <a href=\"https://www.washingtonpost.com/local/a-rare-peek-into-a-justice-department-leak-probe/2013/05/19/0bc473de-be5e-11e2-97d4-a479289a31f9_story.html\">warrant</a> – just like the FBI improperly did in the Russia election collusion investigation – to seize Rosen’s email and telephone records while investigating a leak at the State Department. <strong><a href=\"https://www.foxnews.com/newsletters\" target=\"_blank\">CLICK HERE TO GET THE OPINION NEWSLETTER</a></strong> One former career lawyer who served in the Clinton, Bush, and Obama administrations told us that Holder was “the worst person to hold the position of attorney general since the disgraced John Mitchell,\" who went to jail as a result of the Watergate scandal. Holder claims Barr gave an “ideological” and “nakedly partisan” speech at the Federalist Society’s annual lawyers’ convention. We were at the convention and heard that speech. Apparently, Holder believes that giving an informed, learned speech about the views of the framers of the Constitution on how they drafted that document to provide for a strong executive is “ideological” and “nakedly partisan.” Holder demonstrated during his tenure as attorney general that he believes in a “living” Constitution that can be bent, twisted, broken or just plain ignored when needed to achieve his “nakedly partisan” political goals and to protect his president. It is no wonder that he is critical of an attorney general who actually believes in the rule of law and is forthright in enforcing the Constitution as it was written and intended regardless of partisan politics. Former Attorney General Ed Meese has long had a cardinal rule. He does not criticize the lawyers who hold that office out of respect for the office and the often very tough job of the attorney general. Meese is one of the few class acts in the nation’s capital. <strong><a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> Holder has shown once again his lack of class and why he should never have been attorney general. Holder got only one thing right in his diatribe against William Barr. He says that the American people “deserve an attorney general who serves their interests, leads the Justice Department with integrity and can be entrusted to pursue the facts and the law.” The American people have that with Attorney General William Barr. They never had it with Eric Holder. <strong><a href=\"https://www.foxnews.com/person/v/hans-von-spakovsky\">CLICK HERE TO READ MORE BY HANS VON SPAKOVSKY</a></strong> <a href=\"https://www.foxnews.com/person/f/john-fund\"><strong>CLICK HERE TO READ MORE BY JOHN FUN</strong>D</a> <em>John Fund is a columnist for National Review. Follow him on Twitter <a href=\"https://twitter.com/johnfund\" target=\"_blank\">@JohnFund</a>.</em>", "authors": "Hans A. von Spakovsky", "title": "VON SPAKOVSKY: Barr not 'unfit' to be attorney general – Here's the man who deserves that title"}, "https://www.foxnews.com/politics/squad-impeachment-vote-omar-yells-stop-it-mccarthy-tlaib-ocasio-cortez-pressley": {"content": "Fox News Flash top headlines for Dec. 19 are here. Check out what's clicking on Foxnews.com The group of four freshman House Democrats dubbed <a href=\"https://www.foxnews.com/politics/trump-democrats-party-squad-media-primary-opponent\" target=\"_blank\">“the Squad”</a> each had something to say Wednesday before the entire House voted along party lines to <a href=\"https://www.foxnews.com/category/politics/trump-impeachment-inquiry\" target=\"_blank\">impeach President Trump. </a> In the case of Rep. Ilhan Omar, D-Minn., it was the repeated shouting of \"Stop it!\" when House Republican Leader Kevin McCarthy recounted a profane remark about President Trump that fellow Squad member Rep. Rashida Tlaib, D-Mich., had uttered back in January. On Wednesday, several journalists -- including PBS Newshour senior reporter Daniel Bush, Daily Caller reporter Scott Morefield and others -- identified Omar, who was not seen on camera -- as the voice heard in the background as McCarthy addressed his fellow House members in the U.S. Capitol. <strong><a href=\"https://www.foxnews.com/politics/aoc-tulsi-gabbard-present-vote-impeach-trump\" target=\"_blank\">AOC TAKES A SWIPE AT TULSI GABBARD'S 'PRESENT' VOTES</a></strong> \"What's the problem?\" Morefield wrote, referring to Omar. \"Truth hurt?\" In January -- soon after all four Squad members took office following their elections in November 2018, and months before the July 25 phone call between President Trump and Ukrainian President Volodymyr Zelensky that kicked off the House impeachment inquiry this fall -- Tlaib said on camera at a Capitol Hill reception celebrating the new Congress that “We’re going to go in there and we’re going to impeach the motherf---er,” referring to Trump. “Nothing was going to get in their way and certainly not the truth,” McCarthy began Wednesday. “Madam Speaker, Chairman Schiff said he had evidence, more than circumstantial, of collusion. That was false.  “In January, where we all stood in this body. We stood up. We raised our hands. We swore that we’d uphold the Constitution,” McCarthy continued. “And, a few mere hours after that, Congresswoman Tlaib said she was going to impeach the mother-f-er. Those are not my words.” Omar also commented on Twitter on Wednesday about the impeachment. “The evidence is clear,\" she wrote online. \"Trump extorted a foreign government in an effort to get reelected -- and obstructed Congress’ resulting investigation. He abused his oath of office. Today, I will act to restore balance to our democracy. I will vote to impeach Donald Trump.” Other Squad members shared their views Wednesday as well. During her own floor speech, Tlaib pointed to the “common sense” of the people in her home district in Michigan and veterans’ sense of “duty and responsibly” before citing “bribery” as a reason she supported impeaching Trump -- even though bribery was not included as an article of impeachment.  The Democrat-led House decided to file only two articles – abuse of power and obstruction of Congress. Article one, abuse of power, passed on a 230-197 vote, with two Democrats joining Republicans in voting nay. The obstruction-of-Congress vote was 229-197, with three Democrats voting nay. No Republicans supported either article. “I rise today in support of impeachment. I learn so much every single day from my residents at home. Their common sense and understanding of what is right and wrong centered on why they oppose any person who uses the most powerful position in the world for personal gain,” Tlaib said.  “We honor our veterans in this chamber almost on a daily basis, but do we ever follow their lead? Where we serve the people of the United States and uphold the Constitution not as Republicans or Democrats but as Americans. We should learn from their sense of duty and responsibility to country and democracy -- not a political party. “Doing nothing here, Madam Speaker, is not an option. Looking away from these crimes against our country is not an option. This is about protecting the future of our nation and our democracy from corruption. Abuse of power, criminal cover-ups and bribery.  “This vote is also for my sons and the future of so many generations, so I urge my colleagues to please vote yes on these articles of impeachment,” she concluded.  Alexandria Ocasio-Cortez took aim at Rep. Barry Loudermilk, R-Ga., who – invoking the holiday season – used his speech on the House floor Wednesday to point out that the Romans who persecuted Jesus Christ first gave him a chance to defend himself.  \"Before you take this historic vote today, one week before Christmas, I want you to keep this in mind: When Jesus was falsely accused of treason, Pontius Pilate gave Jesus the opportunity to face his accusers. During that sham trial, Pontius Pilate afforded more rights to Jesus than the Democrats have afforded this President in this process,\" Loudermilk said.  Ocasio-Cortez responded on Twitter with a Bible verse, simply writing: “Romans 1:25” The verse warns against changing the “truth of God into a lie” and instead of worshipping a “creature” more than the blessed Creator -- in what appeared to be a comment from the congresswoman on Republicans' support for President Trump. House Democrats had pointed out that Trump was invited to testify before Congress but refused to comply with the impeachment inquiry.  \"No normal person would be able to get away with attempting to extort a foreign power to compromise our country,” Ocasio-Cortez tweeted Wednesday. “But all too often, the most corrupt and powerful people grow so accustomed to life with impunity that standard accountability feels to them like unjust persecution.”  Rep. Ayanna Pressley, D-Mass.,  also addresssed her fellow House members on Wednesday.  “I rise today to protect our democracy. Today we take a stand against corruption and abuses of power. What we are doing here today is not only patriotic – it is uniquely American,\" she said. \"America is a story of ordinary people confronting abuses of power with the steadfast pursuit of justice. <strong><a href=\"https://www.foxbusiness.com/\" target=\"_blank\">CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM</a></strong> “Throughout our history, the oppressed have been relegated to the margins by the powerful and each time we have fought back. Deliberate in our approach, clear eye. Each generation has fought for the preservation of our democracy, and that is what brings us to the House floor today. Efficient and effective in the pursuit of our truth. “Congress has done its due diligence. Today we send a clear message – we will not tolerate abuse of power from the President of the United States of America. The future of this nation rests in our hands. It is with a heavy heart but a resolved one. And, because I believe our democracy is worth fighting for, I will vote to impeach Donald J. Trump, and I urge my colleagues to do the same,” she concluded. ", "authors": "Danielle Wallace", "title": "Omar shouts ‘stop it!’ as McCarthy says Tlaib’s profane impeachment comment"}, "https://www.foxnews.com/politics/yarmuth-trump-john-dingell-hell": {"content": "'Special Report' anchor Bret Baier says President Trump has possibly hurt himself with Michigan voters and independents after suggesting Democrat Rep. Debbie Dingell's late husband John Dingell may be 'looking up.' <a href=\"https://www.foxnews.com/politics/john-yarmuth-trump-impeachment-nikki-haley-2020\" target=\"_blank\">Rep. John Yarmuth, D-Ky.,</a> had a scathing response to <a href=\"https://www.foxnews.com/category/person/donald-trump\" target=\"_blank\">President Trump</a> after he criticized the former congressman John Dingell, D-Mich., by suggesting that he might be \"looking up\" after his death. \"It's moments like these that we are reminded that the president is not only a criminal, he is impulsively cruel and truly rotten to the core,\" Yarmuth tweeted on Thursday. \"Hell will be too good for him.\" Trump lodged that attack during a Wednesday rally in Michigan after the House of Representatives voted to impeach him. He took special aim at Rep. Debbie Dingell, D-Mich., the former congressman's wife, after she voted to impeach him. “Debbie Dingell, that’s a real beauty,” Trump said to a rapt crowd that booed the mention of Dingell's name. The president said he gave the late Dingell the “A+ treatment” after his death last February and his wife had called him to say “it’s the nicest thing that’s ever happened, thank you so much. John would be so thrilled. He’s looking down.” <a href=\"https://www.foxnews.com/media/debbie-dingell-trump-attack-impeachment-rally\" target=\"_blank\"><strong>REP. DINGELL RESPONDS AFTER TRUMP ATTACKS LATE HUSBAND: WE NEED TO TREAT EACH OTHER WITH 'DIGNITY AND RESPECT'</strong></a> “I said, 'That's OK. Don't worry about it.' Maybe he's looking up. I don't know,\" he quipped to mixed reactions from the audience. “Maybe, but let’s assume he’s looking down.” Rep. Dingell responded on Wednesday night via Twitter. \"Mr. President, let’s set politics aside. My husband earned all his accolades after a lifetime of service,\" she said. \"I’m preparing for the first holiday season without the man I love. You brought me down in a way you can never imagine and your hurtful words just made my healing much harder.\" On Thursday, she also told Fox News' Sandra Smith that the comment made her \"sad.\" <a href=\"https://www.foxnews.com/politics/debbie-dingell-says-trumps-hurtful-joke-that-her-late-husband-might-be-in-hell-made-her-healing-much-harder\" target=\"_blank\"><strong>TRUMP GETS HELL FROM DEBBIE DINGELL AFTER SAYING DEM'S LATE HUSBAND MAY BE 'LOOKING UP' AT MICHIGAN RALLY</strong></a> \"I was already having a hard time with this holiday, and the comment that he made was just -- it made me sad,\" she said. \"But I'm going to keep doing my job and I'm going to work with <a href=\"https://www.foxnews.com/category/politics/senate/republicans\" target=\"_blank\">Republicans</a> and <a href=\"https://www.foxnews.com/category/politics/house-of-representatives/democrats\" target=\"_blank\">Democrats</a>, as I always do.\" <a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> She added that \"compromise isn't a dirty word,\" and \"we need to listen to each other\" and \"respect each other.\" \"Treat each other with dignity and respect and you can get things done,\" she stated. <em>Fox News' Brie Stimson and Julia Musto contributed to this report.</em>", "authors": "Sam Dorman", "title": "House Dem blasts Trump after attack on John Dingell"}, "https://www.foxnews.com/media/meghan-mccain-view-melania-ivanka-dingell": {"content": "'The View' co-host praises Democrat Tulsi Gabbard for her vote in Trump impeachment. <a href=\"https://www.foxnews.com/category/entertainment/the-view\" target=\"_blank\">\"The View\"</a> co-hosts were indignant over <a href=\"https://www.foxnews.com/category/person/donald-trump\" target=\"_blank\">President Trump's</a> comments about former congressman John Dingell, D-Mich., but also made sure to criticize the president's <a href=\"https://www.foxnews.com/category/politics/executive/first-family\" target=\"_blank\">family</a> members over their silence on the issue. \"The Be Best, anti-bullying crap -- I don't want to hear any more from anybody,\" co-host <a href=\"https://www.foxnews.com/category/person/meghan-mccain\" target=\"_blank\">Meghan McCain</a> said, referring to <a href=\"https://www.foxnews.com/category/person/melania-trump\" target=\"_blank\">First Lady Melania Trump's</a> anti-cyber bullying campaign. \"But I don't want to hear it from Ivanka, I don't want to hear it from Melania. Until you get him in line when it comes to disparaging people ... when you are disparaging widows and people who have served the country and war heroes who have passed -- again, I know something about it -- it is, until you get them in line, you are complicit in this as well,\" she added. Co-host Sunny Hostin similarly remarked that she would \"love to see some energy from Melania Trump.\" \"You're not gonna,\" co-host <a href=\"https://www.foxnews.com/category/person/joy-behar\" target=\"_blank\">Joy Behar</a> responded. <a href=\"https://www.foxnews.com/entertainment/meghan-mccain-jared-ivanka-trump-omar\" target=\"_blank\"><strong>MEGHAN MCCAIN TELLS IVANKA AND JARED TO SPEAK UP AFTER TRUMP RALLY: 'WHERE ARE YOU?'</strong></a> The first lady has long come under fire for the apparent hypocrisy of pushing an anti-cyberbullying campaign while her husband attacks people on Twitter. She also received scrutiny for criticizing attacks on her teenage son Barron, but not her husband's attack on 16-year-old <a href=\"https://www.foxnews.com/category/person/greta-thunberg\" target=\"_blank\">Greta Thunberg</a>. Trump lodged his attack during a Wednesday rally in Michigan after the House of Representatives voted to impeach him. He took special aim at Rep. Debbie Dingell, D-Mich., the former congressman's wife, after she voted to impeach him. “Debbie Dingell, that’s a real beauty,” Trump said to a rapt crowd that booed the mention of Dingell's name. The president said he gave the late Dingell the “A+ treatment” after he died last February and his wife had called him to say “it’s the nicest thing that’s ever happened, thank you so much. John would be so thrilled. He’s looking down.” <a href=\"https://www.foxnews.com/politics/yarmuth-trump-john-dingell-hell\" target=\"_blank\"><strong>HOUSE DEM BLASTS TRUMP AFTER ATTACK ON JOHN DINGELL: 'HELL WILL BE TOO GOOD FOR HIM'</strong></a> “I said, 'That's OK. Don't worry about it.' Maybe he's looking up. I don't know,\" he quipped to mixed reactions from the audience. “Maybe, but let’s assume he’s looking down.” On Thursday, Rep. Dingell told Fox News' Sandra Smith that the comment made her \"sad.\" \"I was already having a hard time with this holiday, and the comment that he made was just -- it made me sad,\" she said. \"But I'm going to keep doing my job and I'm going to work with <a href=\"https://www.foxnews.com/category/politics/senate/republicans\" target=\"_blank\">Republicans</a> and <a href=\"https://www.foxnews.com/category/politics/house-of-representatives/democrats\" target=\"_blank\">Democrats</a>, as I always do.\" <a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\"><strong>CLICK HERE TO GET THE FOX NEWS APP</strong></a> She added that \"compromise isn't a dirty word,\" and \"we need to listen to each other\" and \"respect each other.\" \"Treat each other with dignity and respect and you can get things done,\" she stated. <em>Fox News' Brie Stimson and Julia Musto contributed to this report.</em>", "authors": "Sam Dorman", "title": "'The View' hosts browbeat Melania and Ivanka over Trump's John Dingell attack"}, "https://www.foxnews.com/entertainment/harry-potter-j-k-rowling-backlash-supporting-fired-researcher": {"content": "Fox News Flash top entertainment and celebrity headlines for Dec. 19 are here. Check out what's clicking today in entertainment. “<a href=\"https://www.foxnews.com/category/entertainment/genres/books\" target=\"_blank\">Harry Potter</a>” author <a href=\"https://www.foxnews.com/category/entertainment/celebrity-news\" target=\"_blank\">J.K. Rowling</a> is catching backlash from the LGBTQ community after tweeting a defense of a researcher who lost her job for tweeting that men cannot change their biological sex. Rowling spoke out in defense of Maya Forstater, who was fired from her job at a thinktank after tweeting a rebuke of “smart people” who she claims to admire championing the concept of a person identifying with a gender that’s different from the one they were assigned at birth. “Dress however you please. Call yourself whatever you like. Sleep with any consenting adult who’ll have you. Live your best life in peace and security,” <a href=\"https://twitter.com/jk_rowling/status/1207646162813100033\" target=\"_blank\">Rowling tweeted Thursday</a>. “But force women out of their jobs for stating that sex is real?  #IStandWithMaya #ThisIsNotADrill.” Representatives for Rowling had no comment when reached by Fox News. According to <a href=\"https://www.theguardian.com/society/2019/dec/18/judge-rules-against-charity-worker-who-lost-job-over-transgender-tweets\" target=\"_blank\">The Guardian</a>, Forstater lost her job and was accused of using “offensive and exclusionary” language in a tweet opposing a proposal to change the U.K.’s Gender Recognition Act. <a href=\"https://www.foxnews.com/entertainment/jk-rowling-18m-multiple-sclerosis-research\" target=\"_blank\"><strong>JK ROWLING DONATES OVER $19M TO MULTIPLE SCLEROSIS RESEARCH IN HONOR OF HER LATE MOTHER</strong></a> “What I am so surprised at is that smart people who I admire, who are absolutely pro-science in other areas, and champion human rights &amp; womens rights are tying themselves in knots to avoid saying the truth that men cannot change into women (because that might hurt mens feelings),” <a href=\"https://twitter.com/MForstater/status/1046450304986812416\" target=\"_blank\">she tweeted at the time</a>. A Central London employment tribunal convened a preliminary hearing over whether her tweets could be protected under the 2010 Equality Act, but a judge ultimately dismissed that bid. “I conclude from … the totality of the evidence, that [Forstater] is absolutist in her view of sex and it is a core component of her belief that she will refer to a person by the sex she considered appropriate even if it violates their dignity and/or creates an intimidating, hostile, degrading, humiliating or offensive environment. The approach is not worthy of respect in a democratic society,” read the ruling from Judge James Tayler. Rowling has since caught immense backlash on social media for throwing her opinion into the fray. The <a href=\"https://twitter.com/HRC/status/1207675378325770246\" target=\"_blank\">Human Rights Campaign tweeted</a> a rebuke shortly after her tweet writing: “Trans women are women. Trans men are men. Non-binary people are non-binary. CC: JK Rowling.” <a href=\"https://www.foxnews.com/entertainment/j-k-rowling-faces-backlash-on-twitter-for-comments-about-sexual-relationship-between-two-characters\" target=\"_blank\"><strong>J.K. ROWLING FACES BACKLASH ON TWITTER FOR COMMENTS ABOUT ‘SEXUAL’ RELATIONSHIP BETWEEN TWO CHARACTERS</strong></a> Meanwhile, countless other users were quick to call out the famed author for views they consider transphobic. “Another day, another instance of JK Rowling doing something foolish and souring the public perception of her own series,\" <a href=\"https://twitter.com/babysnitchery/status/1207714292625264641\" target=\"_blank\">one person tweeted</a>. \"How condescendingly arrogant of a cis woman; to think it's for her to grant us permission to be ourselves,\" <a href=\"https://twitter.com/SakuraNoSeirei/status/1207703453931323394\" target=\"_blank\">another user said</a>. \"We don't need your permission to be any part of ourselves.\" <strong><a href=\"https://foxnews.onelink.me/xLDS?pid=AppArticleLink&amp;af_dp=foxnewsaf%3A%2F%2F&amp;af_web_dp=https%3A%2F%2Fwww.foxnews.com%2Fapps-products\" target=\"_blank\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> \"JK Rowling gave the world an incredible gift with Harry Potter. That does not mean she is above criticism or justifiable anger. She has proven time and time again that she is not only transphobic, but unwilling to unlearn her prejudices. Hate to say it, but we do not stan,\" <a href=\"https://twitter.com/authorsehanson/status/1207691200398069766\" target=\"_blank\">a third user noted</a>.", "authors": "Tyler McCarthy", "title": "'Harry Potter' author J.K. Rowling roasted for supporting researcher who defended biological sex recognition"}, "https://www.foxnews.com/politics/jeff-van-drew-trump-democrat-republican-switch": {"content": "Melissa Francis and Matt Whitaker, former Acting U.S. Attorney General, discuss Democrat Rep Van Drew switching parties amid impeachment After nearly a week of speculation, <a href=\"https://www.foxnews.com/politics/rep-van-drew-impeachment\" target=\"_blank\">Rep. Jeff Van Drew, D-N.J.</a>, announced Thursday during an Oval Office meeting with <a href=\"https://www.foxnews.com/category/person/donald-trump\" target=\"_blank\">President Trump</a> that he will be joining the Republican party. The congressman, one of just a few Democrats who <a href=\"https://www.foxnews.com/category/politics/trump-impeachment-inquiry\" target=\"_blank\">voted against impeaching Trump on Wednesday</a>, explained his reason for the party switch. \"This is just a better fit for me,\" he said. \"There were other times in my life when I thought about this.\"  <strong><a href=\"https://www.foxnews.com/politics/rep-van-drew-impeachment\" target=\"_blank\">REP. VAN DREW, AHEAD OF EXPECTED PARTY SWITCH, COMPARES IMPEACHMENT TO HOW 'THIRD-WORLD COUNTRIES OPERATE</a></strong> Trump and Van Drew shook hands, with Trump calling him a \"tremendous asset to the party,\" and telling Van Drew \"I'm with you all the way.\" \"I'm with you,\" Van Drew said in response. <a href=\"https://www.foxnews.com/category/person/kevin-mccarthy\" target=\"_blank\">House Minority Leader Kevin McCarthy, R-Calif.</a>, added, \"He’s going from the majority to the minority.  That doesn't happen.\" <a href=\"https://www.foxnews.com/category/person/mike-pence\" target=\"_blank\">Vice President Pence</a> thanked Van Drew for his “common sense,” saying “your district will be as grateful as we are.” Rumblings of a possible party switch in the midst of Democrat-led impeachment proceedings against Trump caused members of Van Drew's caucus to accuse him of clamoring to cross the aisle in an attempt to save his bid for reelection and forced <a href=\"https://www.foxnews.com/politics/jeff-van-drew-blue-dog-coalition-staffers-who-quit-faced-blackball-threats-from-dems\" target=\"_blank\">5 aides from his office to resign</a>. A recent internal poll conducted for the Democrats found that 58 percent of primary voters in Van Drew's 2nd Congressional District wanted to nominate another candidate, while only 28 percent said he should be renominated. \"Don’t know how you won your district as a Democrat,\" Trump said, referring to the southern New Jersey region that Van Drew represents and Trump carried in 2016. Meanwhile, the <a href=\"https://www.foxnews.com/media/harvard-tribe-pelosi-impeachment-senate\" target=\"_blank\">House continues to hem and haw over when exactly they plan on handing over two articles of impeachment to the GOP-led Senate</a> for a trial while Trump continued to lambast the process. “I don’t feel like I’m being impeached,\" Trump said at the White House. \"It’s a hoax and a setup. They have a small majority and they forced people.“ It remains to be seen how Van Drew will vote on legislation now that he is officially a Republican. Out of 659 votes in the 116th Congress, Van Drew and McCarthy have agreed on only 300 votes. As a Democrat, Van Drew voted to override Trump's veto of a bill that overturned his emergency declaration for border wall funding and voted to block Trump from withdrawing from the Paris Climate Change Accord. He has also voted to block the sale of arms to Saudi Arabia and disapproved of the Trump administration's plan to lift sanctions on three Russian companies. In addition, Van Drew has condemned comments Trump made about four congresswomen that the president dubbed \"The Squad,\" calling the remarks racist and has pushed back on Trump's attempts to direct courts to invalidate the Affordable Care Act. \"We worked together across the aisle,\" McCarthy said of Van Drew, despite the fact that the two have disagreed on 54 percent of legislative issues. \"Looking forward to working together now, same party. We only need 18 more to be the majority, and I think we will do that very soon.\" <a href=\"https://www.foxnews.com/apps-products\" style=\"font-weight: bold;\" target=\"_blank\">CLICK HERE FOR THE FOX NEWS APP</a> <em>Fox News Radio's Jon Decker contributed to this report. </em><br/>", "authors": "Vandana Rambaran", "title": "Rep. Jeff Van Drew meets with Trump, confirms he's switching from Democrat to Republican"}, "https://www.foxnews.com/politics/illegal-immigrant-drivers-licenses-phil-murphy": {"content": "Fox News Flash top headlines for Dec. 19 are here. Check out what's clicking on Foxnews.com New Jersey Gov. <a href=\"https://www.foxnews.com/politics/new-jersey-gov-phil-murphy-vows-to-sign-new-assisted-suicide-bill-into-law\" target=\"_blank\">Phil Murphy</a> signed a bill on Thursday allowing <a href=\"https://www.foxnews.com/category/us/immigration/illegal-immigrants\" target=\"_blank\">illegal immigrants</a> to obtain driver's licenses, making <a href=\"https://www.foxnews.com/category/us/us-regions/northeast/new-jersey\" target=\"_blank\">the Garden State</a> the 14th state in the country, along with the District of Columbia, to enact such a measure. \"Expanding access to driver's licenses is critical for the safety of New Jerseyans and a step toward building a stronger and fairer New Jersey for all,\" Murphy said. Murphy, a Democrat, signed the bill after it was <a href=\"https://www.foxnews.com/politics/new-jersey-bill-illegal-immigrants-drivers-license\" target=\"_blank\">approved</a> by the Democratic majorities in both the state Assembly and Senate, during their final legislative sessions of the year. “The legislation advanced on the Assembly floor and by the Senate today is fair and responsible,” Assembly Speaker Craig Coughlin, a Democrat, told The Wall Street Journal. “It brings us one step closer to ensuring all motor vehicles and drivers are insured, thereby creating safer roadways for all New Jersey residents.” <strong><a href=\"https://www.foxnews.com/media/dhs-secretary-chad-wolf-illegal-immigrants-drivers-licenses\" target=\"_blank\">ACTING DHS SECRETARY: STATES PLAYING POLITICS WITH PUBLIC SAFETY BY GIVING DRIVERS LICENSES TO ILLEGALS</a></strong> <a href=\"https://www.njleg.state.nj.us/2018/Bills/S3500/3229_I2.PDF\" target=\"_blank\">The legislation</a> allows illegal immigrants over age 16 to obtain driver's licenses and learner's permits. Applicants can use foreign documents such as passports or their old driver's license from their home country to complete the process. A Social Security number is not required, <a href=\"https://apnews.com/27a4493b9f59c4555b87eb5144b3bb67\" target=\"_blank\">according</a> to The Associated Press. The law reportedly establishes two types of licenses. One would conform to federal REAL ID requirements and would require proof of legal residency. The second license would only require six points of identification. The applicant would not have to provide proof of U.S. citizenship. <strong><a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> A similar measure known as \"The Green Light Law\" was signed by New York's Democratic Gov. Andrew Cuomo earlier this year and <a href=\"https://www.foxnews.com/politics/illegal-immigrants-to-be-able-to-get-drivers-licenses-in-ny-after-legal-challenge-fails\" target=\"_blank\">went into effect</a> this week. It also allows illegal immigrants to obtain a license without having to provide a Social Security number or proof of American citizenship. <em>Fox News' Danielle Wallace and The Associated Press contributed to this report</em>", "authors": "Nick Givas", "title": "New Jersey Gov. Phil Murphy signs law letting illegal immigrants get driver's licenses"}, "https://www.foxnews.com/politics/elizabeth-warren-ed-buck-obama-endorsements": {"content": "Democratic presidential candidates Joe Biden, Michael Bloomberg and Pete Buttigieg draw fire from Elizabeth Warren; Peter Doocy reports from Manchester, New Hampshire. <a href=\"http://www.foxnews.com/category/person/elizabeth-warren\">Sen. Elizabeth Warren's</a> campaign raised eyebrows after announcing that <a href=\"https://www.foxnews.com/us/ed-buck-hires-former-oj-simpson-prosecutor-christopher-darden\">Ed Buck</a>, an accused sexual predator and former megadonor for the Democrats, was among hundreds of Obama-era figures who endorsed her candidacy. It was first reported Wednesday by <a href=\"https://www.foxnews.com/media/cnn-pelosi-house-impeachment-praisehttps://www.foxnews.com/media/cnn-pelosi-house-impeachment-praise\">CNN</a> that Warren, D-Mass., was being backed by over 200 campaign aides and administration officials under former President Obama, all of whom signed a letter announcing their support for the progressive candidate in an effort organized by former senior Obama aides Sara El-Amine and Jon Carson. CNN highlighted some names on the list, including former U.S. Ambassador to Syria Robert Ford and former USAID official Sean Carroll. However, CNN failed to highlight <a href=\"http://cdn.cnn.com/cnn/2019/images/12/18/obama.alumni_final.pdf\">signature #39</a>, which belonged \"Edward P. B. Buck\" and was listed as an alum of Obama's 2012 campaign. He's better known as the activist who gave hundreds of thousands of dollars to causes championed by the Democrats, and who made headlines in 2017 after two men died of overdoses in his West Hollywood, Calif., home. Warren had boasted the CNN article on her Twitter and Facebook pages. \"I'm grateful to have the support of these Obama campaign alumni and my fellow Obama administration alumni. Their work changed what we know is possible in our politics. Together, we can win in 2020 and build a government that works for everyone,\" Warren <a href=\"https://twitter.com/ewarren/status/1207301452542164994\" target=\"_blank\">tweeted.</a> <a href=\"https://www.foxnews.com/us/ed-buck-hires-former-oj-simpson-prosecutor-christopher-darden\"><strong>ED BUCK HIRES FORMER OJ SIMPSON PROSECUTOR CHRISTOPHER DARDEN FOR DEFENSE</strong></a> Warren campaign spokesman Chris Hayden told Fox News, \"This was a mistake considering Ed Buck was not staff or an alum. This was put together via Google doc by some Obama alums and they caught some non-staff that populated the list but obviously they missed one. They are removing it.\" Max Berger, another Warren aide, went even further, claiming that someone added \"fake names\" to the list. \"This was compiled by volunteers from the Obama network,\" Berger <a href=\"https://twitter.com/maxberger/status/1207760315796074497\" target=\"_blank\">tweeted.</a> \"Someone added fake names to the list. The volunteers caught most of them. They obviously missed one.\" He added, \"Ed Buck is in prison. He has no access to email. He couldn't have signed this letter.\" <a href=\"https://www.foxnews.com/us/dem-megadonor-ed-buck-federally-indicted-for-2-overdose-deaths-at-his-home-providing-meth-to-3-more-men\">Buck was indicted this past October</a> with distributing methamphetamine that resulted in the deaths of Timothy Dean in January and Gemmel Moore in 2017. Federal prosecutors said Buck, 65, preyed on vulnerable gay black men and pressured them to let him inject them with drugs as part of a sexual ritual known as “party and play,\" <a href=\"https://www.nbclosangeles.com/news/local/ed-buck-hires-noted-attorney-to-defend-federal-drug-death-case/2278443/\">KNBC</a> reported. <strong><a href=\"https://www.foxnews.com/apps-products?pid=AppArticleLink\" target=\"_blank\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> <a href=\"https://www.foxnews.com/us/major-democratic-donor-ed-buck-arrested-charged-with-running-drug-den\">Buck was arrested Sept. 17</a> and hit with state charges of operating a drug house. <a href=\"https://www.foxnews.com/us/ed-buck-dem-megadonor-hit-with-federal-charge-in-mans-2017-overdose-death\">Two days later, federal prosecutors charged him with distributing methamphetamine that resulted in Moore’s death.</a> The alleged predator was being held without bail, and his trial is set for August 2020 at the earliest. <em>Fox News' Frank Miles contributed to this report. </em>", "authors": "Joseph A. Wulfsohn", "title": "Ed Buck included in Elizabeth Warren's list of Obama-era endorsements; campaign calls it 'mistake'"}, "https://www.foxnews.com/politics/senate-passes-spending-bills-avoids-government-shutdown": {"content": "Fox News Flash top headlines for Dec. 19 are here. Check out what's clicking on Foxnews.com The <a href=\"https://www.foxnews.com/category/politics/senate\" target=\"_blank\">Senate</a> on Thursday passed a $1.4 trillion <a href=\"https://www.foxnews.com/category/politics/senate/budget\" target=\"_blank\">spending package</a>, avoiding a shutdown and funding the government through the rest of the fiscal year. The first bill in the two-bill package, covering domestic programs, passed 71 to 23. The second spending bill passed 81 to 11, and the pair will now head to President Trump's desk Friday night -- the deadline to fund the government for the rest of fiscal year 2020, or through Sept. 30. The White House said Tuesday that the president will sign the bill. The legislation gives Trump a victory on his U.S.-Mexico border fence and gives Democrats domestic spending increases and an expensive repeal of Obama-era taxes on high-cost health plans. It provides health care and pension benefits for retired coal miners and increases the nationwide legal age to buy tobacco products, including e-cigarettes, from 18 to 21. The tobacco measure was pushed by Sen. Majority Leader Mitch McConnell, R.-Ky. <a href=\"https://www.foxnews.com/politics/house-approves-1-4-trillion-spending-bill-avoiding-government-shutdown\" target=\"_blank\"><strong>HOUSE APPROVES $1.4 TRILLION SPENDING BILL, REPEALING OBAMACARE TAXES </strong></a> The deficit tab for the package grew, as well, with the addition of $428 billion in tax cuts over 10 years to repeal the three so-called ObamaCare taxes. The split-their-differences legislation was carrying a large number of unrelated provisions into law, drawing protests from fiscal conservatives. It would put in place an earlier spending deal that reversed unpopular and unworkable automatic spending cuts to defense and domestic programs -- at a $2.2 trillion cost over the coming decade. “These spending bills are a fiscal dumpster fire,” said Sen. Mike Lee, R-Utah. “This is embarrassing.” The legislation is laced with provisions reflecting divided power in Washington. Republicans maintained the status quo on several abortion-related battles and on funding for Trump's border wall. <a href=\"https://www.foxnews.com/politics/congress-raises-national-tobacco-age-to-21-spending-package\" target=\"_blank\"><strong>CONGRESS RAISES NATIONAL TOBACCO AGE TO 21 AS PART OF SPENDING PACKAGE </strong></a> Democrats controlling the House succeeded in winning a 3.1 percent raise for federal civilian employees and the first installment of funding on gun violence research after more than two decades of gun lobby opposition. The bill provides $25 million for gun violence research, divided between the National Institutes of Health and the Centers for Disease Control and Prevention. The bill exceeds Trump’s budget requests in every domestic category, except for his $8 billion-plus for the U.S.-Mexico wall, which was cut back to $1.4 billion -- the same as last year’s appropriation. However, Trump may use his budget powers to tap other accounts for several times that amount. Though it may anger liberal opponents to the wall, it was a trade-off for Democrats who wanted to gain $27 billion in increases for domestic programs. Popular programs such as health research, veterans' medical care, NASA, sewer and water projects, and law enforcement grants to state and local governments would also get increases under the package. The Pentagon would receive $738 billion, a record amount, to buy expensive weapons systems such as the F-35 fighter. <strong><a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> Democrats won $425 million for states to upgrade their election systems, and in turn, they boosted the U.S. Census budget $1.4 billion above Trump’s request. <em>Fox News' Chad Pergram and Alex Pappas contributed to this report, as well as The Associated Press.</em>", "authors": "Morgan Phillips", "title": "Senate OKs spending bills to avoid government shutdown, sending them to Trump's desk"}, "https://www.foxnews.com/politics/fox-news-poll-end-of-the-decade-not-impressing-voters": {"content": "Joe Biden uses impeachment to ask supporters for money; Peter Doocy reports from Los Angeles. In a year that saw many historic events, including the <a href=\"https://www.foxnews.com/category/politics/trump-impeachment-inquiry\">impeachment</a> of a sitting president for only the third time in U.S. history, voters are mixed on how America has fared these last 12 months. According to the latest <a href=\"https://www.foxnews.com/category/columns/fox-news-poll\">Fox News poll</a>, released Thursday, 37 percent of voters think 2019 was a good year for the United States, while almost the same number, 38 percent, say it was bad.  Last year, 40 percent said good and 43 percent bad (December 2018). <strong><a href=\"https://www.foxnews.com/politics/fox-news-poll-dec-19\">CLICK HERE TO READ THE POLL RESULTS</a></strong> Twenty percent are unsure how the year went for the country, a 7-point increase from last year. <source media=\"(max-width: 767px)\" srcset=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/12/1470/828/poll1.jpg?ve=1&amp;tl=1 2x\"><source media=\"(min-width: 767px)\" srcset=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/12/1862/1048/poll1.jpg?ve=1&amp;tl=1 2x\"><img alt=\"\" src=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/12/640/320/poll1.jpg?ve=1&amp;tl=1\"/></source></source></picture></div><!-- --></div><div class=\"ad-container mobile\"><div class=\"ad gpt ad-h-250\" data-ad-lz=\"\" data-ad-pos=\"mobile\" data-ad-size=\"300x251\"></div><!-- --></div><p>Those least likely to think it was a good year include Democrats (13 percent), black voters (21 percent), and voters under age 35 (27 percent). Republicans (65 percent) and white evangelical Christians (50 percent) are among those most likely to say the year went well for America. <source media=\"(max-width: 767px)\" srcset=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/12/1470/828/poll2.jpg?ve=1&amp;tl=1 2x\"><source media=\"(min-width: 767px)\" srcset=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/12/1862/1048/poll2.jpg?ve=1&amp;tl=1 2x\"><img alt=\"\" src=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/12/640/320/poll2.jpg?ve=1&amp;tl=1\"/></source></source></picture></div><!-- --></div><p>Voters feel better about how things went for them personally: 47 percent say 2019 was a good year for their family versus 26 percent who say it was a bad year. Some 22 percent have mixed feelings. <source media=\"(max-width: 767px)\" srcset=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/12/1470/828/poll3.jpg?ve=1&amp;tl=1 2x\"><source media=\"(min-width: 767px)\" srcset=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/12/1862/1048/poll3.jpg?ve=1&amp;tl=1 2x\"><img alt=\"\" src=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/12/640/320/poll3.jpg?ve=1&amp;tl=1\"/></source></source></picture></div><!-- --></div><p>There are some warning signs though:  this is the first time in seven years that fewer than half say the year has been a good one for them. The last time voters were this negative was 2012 (42 percent good year / 41 percent bad).  The lowest rating was a decade ago: just 34 percent were happy with the way things went for them in 2009. <source media=\"(max-width: 767px)\" srcset=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/12/1470/828/poll4.jpg?ve=1&amp;tl=1 2x\"><source media=\"(min-width: 767px)\" srcset=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/12/1862/1048/poll4.jpg?ve=1&amp;tl=1 2x\"><img alt=\"\" src=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/12/640/320/poll4.jpg?ve=1&amp;tl=1\"/></source></source></picture></div><!-- --></div><p>The shifts since 2012 are mostly political in nature:  Democrats were happier with 2012 than 2019 by 28 points (57 percent vs. 29 percent today), while Republicans are 41 points more likely to say 2019 has been their year (28 percent vs. 69 percent now). <strong><a href=\"https://www.foxnews.com/apps-products?pid=AppArticleLink\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> Still, when voters are asked to think about four years ago compared to today, they are more likely to say their family is better off (34 percent) than worse off (23 percent). However, the largest number say their lives are the same (41 percent). <source media=\"(max-width: 767px)\" srcset=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/12/1470/828/poll5.jpg?ve=1&amp;tl=1 2x\"><source media=\"(min-width: 767px)\" srcset=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/12/1862/1048/poll5.jpg?ve=1&amp;tl=1 2x\"><img alt=\"\" src=\"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/12/640/320/poll5.jpg?ve=1&amp;tl=1\"/></source></source></picture></div><!-- --></div><p>Conducted December 8-11, 2019, under the joint direction of Beacon Research (D) and Shaw &amp; Company (R), this Fox News Poll includes interviews with 1,000 randomly chosen registered voters nationwide who spoke with live interviewers on both landlines and cellphones. The poll has a margin of sampling error of plus or minus 3 percentage points for all registered voters.", "authors": "Victoria Balara", "title": "Fox News Poll: End of the decade not impressing voters"}, "https://www.foxnews.com/us/5-new-jersey-officials-political-candidates-accused-of-taking-massive-bribes-indicted": {"content": "Fox News Flash top headlines for Dec. 19 are here. Check out what's clicking on Foxnews.com Five current and former New Jersey public officials are facing charges of accepting bribes following a major corruption investigation, the state’s attorney general <a href=\"https://www.nj.gov/oag/newsreleases19/pr20191219a.html\" target=\"_blank\">announced</a>. The five defendants are charged with taking thousands of dollars in bribes from one cooperating witness in the form of campaign contributions, Attorney General Gurbir Grewal said. In return, the officials promised the cooperating witness, who is a tax attorney, they would vote or use their office of influence to hire or continue to hire his law firm for lucrative government legal work. The defendants include Sudhan Thomas, incumbent Jersey City school board president, and former State Assemblyman Jason O’Donnell, who ran an unsuccessful campaign to be mayor of Bayonne in 2018. Some of the multi-thousand-dollar bribes came in envelopes or paper bags filled with cash -- or, in one case, a coffee cup stuffed with cash -- and were delivered to the defendants by the tax attorney at restaurants, parking lots, a political fundraiser and a campaign headquarters. Thomas was charged with accepting $35,000 in cash bribes, with $10,000 delivered in one instance and $25,000 delivered on another date. <a href=\"https://www.foxnews.com/politics/illegal-immigrant-drivers-licenses-phil-murphy\" target=\"_blank\"><strong>NEW JERSEY GOV. PHIL MURPHY SIGNS LAW LETTING ILLEGAL IMMIGRANTS GET DRIVER'S LICENSES </strong></a> In return for the cash payments, Thomas allegedly agreed to arrange for the tax attorney to be hired as a special counsel for the Jersey City Board of Education. His misconduct took place between May and July 2019. Thomas lost his bid for re-election to the Jersey City School Board in November. O’Donnell, former state assemblyman, is charged with accepting a $10,000 bribe. O’Donnell allegedly accepted the bribe in so-called “street money” for his mayoral campaign from the cooperating witness in April and  May 2018. O’Donnell allegedly agreed to provide him with tax work from Bayonne if elected mayor. In the complaint, the tax attorney told O’Donnell “I just wanna be your tax guy,” to which O’Donnell responded, “Done.” “Jason O'Donnell has dedicated his life to serving his community, has always conducted himself in a manner that makes his family and friends proud, and has consistently and vigorously fought for their best interests,” O’Donnell’s attorney, Leo Hurley, told Fox News. “He intends to contest these allegations with equal vigor and to enter a plea of not guilty to the charges against him.” Former Morris County Freeholder John Cesaro was charged for allegedly accepting an envelope containing $10,000 in cash and $2,350 in checks from the cooperating witness. He later returned the cash and asked for it to be replaced with checks. The two allegedly discussed using “straw donors.” <a href=\"https://www.foxnews.com/politics/jeff-van-drew-blue-dog-coalition-staffers-who-quit-faced-blackball-threats-from-dems\" target=\"_blank\"><strong>JEFF VAN DREW OUSTED FROM BLUE DOG DEMS; GETS OFFICE HELP FROM GOP AFTER STAFFERS QUIT </strong></a> At a later fundraiser, the complaint said Cesaro accepted two checks for $2,600 each, the maximum limit for contributions in any given state election per candidate. The cooperating witness described them as “my straws.” Former Mount Arlington Councilman John Windish allegedly accepted a $7,000 cash bribe for his unsuccessful bid for re-election to borough council in June 2018. In return, Windish allegedly promised that he would support the tax attorney’s appointment for borough attorney. Mary Dougherty, a real estate agent from Morristown, allegedly accepted a cash bribe for $10,000 from the cooperating witness. It was initially delivered as cash but later converted to checks from “straw donors” During a meeting at a restaurant, Dougherty allegedly accepted the $10,000 cash in a takeout coffee cup. The pair met again and Dougherty accepted four checks, each for $2,500. When the checks were delivered, the cooperating witness said. “These are my straws… so I just need your support for reappointment. Don’t forget me.” “I won’t. I promise. A friend is a friend, my friend,” said Dougherty. O’Donnell and Dougherty were charged only with second-degree bribery, since they were not yet in office at the time of the alleged bribe. Thomas, Cesaro and Windish are also charged with second-degree acceptance of unlawful benefit by a public servant for official behavior. <strong><a href=\"https://www.foxnews.com/apps-products?pid=AppArticleLink\" target=\"_blank\">CLICK HERE FOR THE FOX NEWS APP</a></strong> Second-degree crimes carry a sentence of five to 10 years in state prison and a fine of up to $150,000. The second-degree charges against those who held public office at the time of their alleged conduct carry a mandatory minimum sentence of five years in prison without eligibility of parole under New Jersey’s enhanced penalties for official corruption.", "authors": "Morgan Phillips", "title": "5 New Jersey officials, political candidates accused of taking massive bribes indicted"}, "https://www.foxnews.com/politics/obamas-doc-biden-not-healthy": {"content": "'The Daily Briefing' host Dana Perino reacts to the Biden campaign's bold strategy. One of <a href=\"https://www.foxnews.com/category/person/barack-obama\" target=\"_blank\">President Obama's</a> former doctors reportedly disputed a letter released by former Vice President <a href=\"https://www.foxnews.com/category/person/joe-biden\" target=\"_blank\">Joe Biden</a>'s campaign in which the former vice president's own doctor praised the 77-year-old presidential candidate as a \"healthy, vigorous\" man. “He’s not a healthy guy,” said <a href=\"https://www.foxnews.com/story/why-president-obamas-former-doctor-doesnt-agree-with-his-health-care-plan\" target=\"_blank\">Dr. David Scheiner</a>, who previously served as Obama's physician. According to the <a href=\"https://www.washingtonexaminer.com/news/lot-of-issues-former-obama-doctor-says-biden-is-not-a-healthy-guy\" target=\"_blank\">Washington Examiner</a>, Scheiner read Biden's medical history and said the presidential candidate \"has a lot of issues.\" “He’s not in bad shape for his age, but I wouldn't say he’s in outstanding health. Could I guarantee he won't have issues for the next four years? He has a lot of issues that are just sort of sitting there,\" Scheiner said. Scheiner previously told the Examiner that Biden \"looked frail\" during the first Democratic primary debate. \"I sort of got the feeling he wasn’t very strong. It was similar to the feeling I got when Republicans started attacking Mueller so fiercely,\" he <a href=\"https://www.foxnews.com/politics/obamas-former-doctor-thinks-biden-looks-frail\" target=\"_blank\">said.</a> <a href=\"https://www.foxnews.com/politics/biden-doctor-statement-healthy-vigorous-77-year-old\" target=\"_blank\"><strong>BIDEN CAMPAIGN RELEASES DOCTOR STATEMENT CALLING HIM 'HEALTHY, VIGOROUS 77-YEAR-OLD'</strong></a> Questions about Biden’s health and age have repeatedly come up since even before the former vice president declared his candidacy in April. In September, Biden committed to publicly releasing his medical records before the Iowa caucuses, to try and put to rest concerns over whether he was fit enough to take on <a href=\"https://www.foxnews.com/category/politics/elections/campaigning/trump-2020-campaign\">President Trump</a> in a general election campaign -- and whether he would be up to the rigors and stress of serving as president. On Tuesday, the Biden campaign released a statement from Dr. Kevin O'Connor, who served as White House physician to Biden for several years. \"Vice President Biden is a healthy, vigorous 77-year-old male, who is fit to successfully execute the duties of the presidency, to include those as chief executive, head of state and commander in chief,” Dr. Kevin O’Connor said. In his report, O’Connor said that Biden is currently being treated for non-valvular atrial-fibrillation, better known as Afib, which is an irregular heartbeat. He said Biden is also being treated for hyperlipidemia, which is an abnormally high concentration of fats or lipids in the blood, as well as gastroesophageal reflux, a digestive disorder that occurs when acidic stomach juices, or food and fluids, back up from the stomach into the esophagus. And he noted that Biden – as many Americans do – suffers from seasonal allergies. <a href=\"https://www.foxnews.com/politics/bloomberg-letter-doctor-outstanding-health\" target=\"_blank\"><strong>BLOOMBERG RELEASES LETTER FROM DOCTOR SAYING HE'S IN 'OUTSTANDING HEALTH'</strong></a> “For these, he takes three common prescription medications and two common over-the-counter medications,” O’Connor said. His report listed Biden's weight as 178 pounds and his height as 5 feet, 11.65 inches. Biden's campaign did not immediately respond to Fox News' request for comment. Scheiner also commented on former New York City Mayor <a href=\"https://www.foxnews.com/category/person/michael-bloomberg\" target=\"_blank\">Michael Bloomberg's</a> health. Bloomberg, also 77, threw his hat into the <a href=\"https://www.foxnews.com/category/politics/2020-presidential-election\" target=\"_blank\">2020 race</a> late and provoked speculation that he thought 2020 frontrunners like Biden couldn't cut it. <strong><a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> Bloomberg previously released his medical history with his doctor describing his health as \"outstanding.\" “'Outstanding health'? With that history, I wouldn’t call it outstanding health,” Scheiner said, referring to the description as \"hyperbole.\" Bloomberg's doctor had disclosed that the former mayor was receiving treatment for arthritis and heartburn. The letter added that Bloomberg takes a blood thinner to treat atrial fibrillation and another medication to control his cholesterol. <em>Fox News' Paul Steinhauser and Kelly Phares contributed to this report.</em>", "authors": "Sam Dorman", "title": "Obama's former doc says Biden 'not a healthy guy' after reviewing medical info: Report"}, "https://www.foxnews.com/politics/woman-spurned-alleged-ilhan-omar-affair-cut-off-bizarre-divorce-proceedings": {"content": "Democrat Rep. Ilhan Omar's Homes for All Act pledges to build 12 million new public and private housing units. A local judge granted a divorce Thursday to a D.C. doctor who accused <a href=\"https://www.foxnews.com/search-results/foxnews.com/category/person/ilhan-omar\" target=\"_blank\">Rep. Ilhan Omar</a> of having an affair with her husband, in a court hearing that ended abruptly after the wife brought up the controversial Minnesota congresswoman. Superior Court Judge Darlene Soltys had just applauded Beth and Tim Mynett for reaching a divorce settlement amicably when Beth Mynett spoke up. “[Through] extensive documentation and his own words, Tim acknowledged he has been engaged in an extramarital romantic relationship with Ilhan Omar, which proceeded and precipitated the divorce,” Beth Mynett, a doctor and mother, said. But Tim Mynett and his lawyer seemed stunned by Beth Mynett’s sudden speech and immediately asked that she stop. <a href=\"https://www.foxnews.com/politics/squad-impeachment-vote-omar-yells-stop-it-mccarthy-tlaib-ocasio-cortez-pressley\" target=\"_blank\"><strong>OMAR REPORTEDLY SHOUTS 'STOP IT!' AS GOP'S MCCARTHY RECOUNTS TLAIB'S PROFANE COMMENT ABOUT TRUMP IMPEACHMENT</strong></a> “I’m almost finished,” said Beth Mynett, who filed for divorce in August in bombshell court papers alleging her marriage fell apart because Tim Mynett fell in love with Omar while working for her and had carried on an extramarital affair with the freshman Democrat. The judge broke up the speech and called the attorneys for both Mynetts to the bench and put on sound to drown out their conversations. Then the court hearing abruptly ended without a formal announcement of adjournment. Both parties left with their lawyers and declined comment. A court clerk came into the hallways afterward with paperwork looking for the Mynetts but was surprised to find them already long gone. Both Tim Mynett, a political consultant, and Omar have denied any affair. The divorce case had been rescheduled at least two times prior. The late-morning hearing at the family division of the Superior Court of the District of Columbia was delayed as both Mynetts and their lawyers huddled in a private room to work out the terms of the settlement. Important to Beth Mynett was that Tim withdraw his counterclaim where he denied the affair with Omar, said he had “been unhappy for the better part\" of his relationship with his wife, and accused her of launching a “negative campaign” to ruin his career and damage his relationship with their son and his stepdaughter. While the details of the settlement were not immediately available, courtroom discussion Thursday seemed to indicate the agreement included such a withdrawal. Lawyers for both sides had also worked out an agreement resolving all the issues of custody, finances and attorney fees. Both Mynetts had signed off on the settlement paperwork and told the court they will abide by the terms. <a href=\"https://www.foxnews.com/politics/trump-tlaib-video-excited-impeachment\" target=\"_blank\"><strong>TRUMP CALLS OUT RASHIDA TLAIB FOR POSTING VIDEO OF HERSELF EXCITEDLY WALKING TO IMPEACHMENT VOTE</strong></a> But it wasn't over. As Tim Mynett waited inside the courtroom, Beth Mynett sat outside in the hallway and read aloud from her phone -- apparent practice for her courtroom speech. Around 12:30 p.m., the Mynetts appeared before Soltys for a brief hearing to have the settlement finalized. Soltys asked both parties a series of questions, including whether Beth Mynett thought there was any hope for reconciliation. “Absolutely, not,” she said. Mynett also wanted to have her former name restored. “I no longer want to have Mr. Mynett’s name attached to me,” Beth explained. The judge then asked if Tim Mynett disagrees with anything his spouse said: \"I do not,\" he said. Soltys signed off on all the paperwork. “So that takes care of everything. The divorce is now final,” Soltys declared roughly 10 minutes into the court hearing. Soltys then praised the Mynetts for the smooth settlement when too often parents have prolonged court fights. She gave the pair kudos for hashing out the details of their divorce settlement behind the scenes and working to co-parent their child. “You should be real pleased with yourself,” the judge said. Then just as the hearing was to wrap up, Beth Mynett spoke up. She wanted to let the court know under threat of “perjury” that it was “appropriate and just” that her ex withdrew his \"false\" counterclaim against her. She went on to say she was \"devoted\" to her marriage and her husband indeed had \"happiness\" during their 13 years together and seven years of marriage. But her speech was cut short after mentioning Tim Mynett's alleged affair with Omar. Tim Mynett worked for Omar and his business, E Street Group, got $370,000 of her campaign funds, <a href=\"https://nypost.com/2019/11/17/ilhan-omar-funneled-another-150k-to-alleged-lovers-consulting-group/\" target=\"_blank\">according to The New York Post</a>, which broke the news of the initial divorce filing. Conservative watchdogs <a href=\"https://nypost.com/2019/08/28/ilhan-omars-alleged-affair-with-consultant-sparks-calls-for-ethics-probe/\" target=\"_blank\">have filed campaign finance complaints</a> against Omar seeking a probe into whether she used the campaign funds to rendezvous with her alleged lover. Omar filed for divorce from her husband in October and blamed the media and political foes for killing her marriage. “Ilhan and Ahmed [Hirsi] have been the object of speculation and innuendo from political opponents and the media,” according to a statement from Omar’s lawyer <a href=\"https://nypost.com/2019/10/07/ilhan-omar-blames-the-media-political-foes-for-killing-her-marriage/\">published by The New York Post</a>. <strong><a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\">CLICK HERE TO GET THE FOX NEWS APP</a></strong> “This has taken a significant toll on Ilhan, Ahmed and their three children. As with all marriages, this is intensely personal and a difficult time for their family,” the statement said. “Just like any other family navigating this kind of transition, Ilhan wishes to have their privacy respected for themselves and their children and will not be commenting any further,\" it added.", "authors": "Marisa Schultz", "title": "Woman spurned in alleged Ilhan Omar affair cut off by court in bizarre divorce proceedings"}, "https://www.foxnews.com/politics/liberal-pac-demands-refund-jeff-van-drew-party-swap": {"content": "President Trump slams House Democrats' impeachment push, touts the strength of the U.S. economy. A liberal PAC is demanding that <a href=\"https://www.foxnews.com/politics/jeff-van-drew-trump-democrat-republican-switch\" target=\"_blank\">Rep. Jeff Van Drew, R-N.J.</a>, refund a donation it made to him when he was a part of the Democratic caucus now that he has officially switched political parties. House Majority PAC Executive Director Abby Curran Horrell wrote an email to Van Drew's campaign Thursday after he made the announcement, asking him to return a $2,500 contribution they made during his run for Congress. <strong><a href=\"https://www.foxnews.com/politics/jeff-van-drew-trump-democrat-republican-switch\" target=\"_blank\">REP. JEFF VAN DREW MEETS WITH TRUMP, CONFIRMS HE'S SWITCHING FROM DEMOCRAT TO REPUBLICAN</a></strong> \"House Majority PAC is dedicated to protecting and expanding our Democratic Majority, and your shameful decision to join Trump's GOP is not in line with our values or our stated mission,\" the email said. President Trump welcomed the freshman congressman, who represents the 2nd Congressional District in New Jersey, into the Republican fold during an Oval Office news conference Thursday afternoon, promising his endorsement for Van Drew's reelection. Van Drew later confirmed that the president \"volunteered\" his support in the Republican primary and said having the president in his corner \"is helpful\" to his reelection, which is slated to be an uphill battle -- even in a district that Trump clinched in 2016. Trump \"certainly has a strong sense to him,\" Van Drew said, \"and I think that if he declares that support, I think it will be helpful.\"<br/><br/><strong><a href=\"https://www.foxnews.com/apps-products\" target=\"_blank\">CLICK HERE FOR THE FOX NEWS APP</a></strong> Trump is likely to hold a rally in New Jersey on behalf of Van Drew as soon as January, according to a top Republican involved in the discussions, The <a href=\"https://twitter.com/costareports/status/1207760388412116997?s=20\" target=\"_blank\">Washington Post</a> reported.", "authors": "Vandana Rambaran", "title": "Liberal PAC demands refund of Jeff Van Drew donation as he swaps parties"}}